org/R-text-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-27 水 23:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>入門統計学 (2)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">入門統計学 (2)</h1>


<div id="outline-container-orge246a35" class="outline-2">
<h2 id="orge246a35">script</h2>
<div class="outline-text-2" id="text-orge246a35">
<div class="org-src-container">
<pre class="src src-R">


</pre>
</div>
</div>
</div>

<div id="outline-container-org0353f9d" class="outline-2">
<h2 id="org0353f9d">2章</h2>
<div class="outline-text-2" id="text-org0353f9d">
</div>
<div id="outline-container-org8de9d8a" class="outline-3">
<h3 id="org8de9d8a">2.2 二項分布の例題</h3>
<div class="outline-text-3" id="text-org8de9d8a">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #99968b;">## </span><span style="color: #99968b;">&#20837;&#38272;&#32113;&#35336;&#23398;2&#31456;1&#31680;</span>

<span style="color: #99968b;">## </span><span style="color: #99968b;">dbinom(x, size, prob)</span>

<span style="color: #99968b;">## </span><span style="color: #99968b;">&#20108;&#38917;&#20998;&#24067; nCx p^x &#12398;&#35336;&#31639;</span>

dbinom(c(0,1,2,3,4),3,1/3)

plot(dbinom(c(0,1,2,3,4),3,1/3),type=<span style="color: #95e454;">"h"</span>)
</pre>
</div>

<pre class="example">
[1] 0.29629630 0.44444444 0.22222222 0.03703704 0.00000000
</pre>
</div>
</div>

<div id="outline-container-orgdd70224" class="outline-3">
<h3 id="orgdd70224">2.3 正規分布</h3>
<div class="outline-text-3" id="text-orgdd70224">
<p>
例題：正規分布の確率計算
</p>

<div class="org-src-container">
<pre class="src src-R">
<span style="color: #99968b;">## </span><span style="color: #99968b;">&#20837;&#38272;&#32113;&#35336;&#23398;2&#31456;1&#31680;</span>

<span style="color: #99968b;">## </span><span style="color: #99968b;">dnorm(x, mean=, sd=) x &#12391;&#12398;&#30906;&#29575;&#23494;&#24230;</span>
<span style="color: #99968b;">## </span><span style="color: #99968b;">norm(x, mean=, sd=)  0..x &#12414;&#12391;&#12398;&#30906;&#29575;</span>

<span style="color: #99968b;"># </span><span style="color: #99968b;">dnorm</span>
dnorm(c(0,1,2,3,4),mean=1,sd=sqrt(2/3))

plot(dnorm(c(0,1,2,3,4),mean=1,sd=sqrt(2/3)))

<span style="color: #99968b;"># </span><span style="color: #99968b;">pnorm</span>
pnorm(44, mean=40, sd=2)

</pre>
</div>

<pre class="example">
[1] 0.2307994842 0.4886025119 0.2307994842 0.0243260867 0.0005720947
[1] 0.9772499
</pre>
</div>
</div>

<div id="outline-container-orgf25c7f0" class="outline-3">
<h3 id="orgf25c7f0">2.4 標準化と偏差値 例題</h3>
<div class="outline-text-3" id="text-orgf25c7f0">
<p>
例題: 胡瓜収穫量の標準化
</p>
</div>

<div id="outline-container-org00044fa" class="outline-4">
<h4 id="org00044fa">胡瓜収穫量データの読み込み</h4>
<div class="outline-text-4" id="text-org00044fa">
<p>
<a href="http://wiki.cis.iwate-u.ac.jp/~suzuki/biostat/org/R-text/data/01-02.csv">http://wiki.cis.iwate-u.ac.jp/~suzuki/biostat/org/R-text/data/01-02.csv</a>
</p>

<p>
上記のデータをダウンロードし，データの読み込み先を，自分の環境に
あわせてください
</p>

<div class="org-src-container">
<pre class="src src-R">
(csv.1.2 <span style="color: #e5786d;">&lt;-</span> read.csv(<span style="color: #95e454;">"R-text/data/01-02.csv"</span>))
<span style="color: #99968b;"># </span><span style="color: #99968b;">class(csv.1.2)</span>
<span style="color: #99968b;"># </span><span style="color: #99968b;">(csv.1.2[,1:2])</span>
<span style="color: #99968b;"># </span><span style="color: #99968b;">class(csv.1.2[,1:2])</span>

</pre>
</div>

<pre class="example" id="org8985f77">
	 栽培法A 栽培法B
      1     3063    3157
      2     2275    2707
      3     2089    3270
      4     2855    3181
      5     2836    3633
      6     3219    3404
      7     2817    2219
      8     2136    2730
      9     2540    3408
      10    2263    3203
      11    2140    2938
      12    1757    3286
      13    2499    2920
      14    2093    3332
      15    2073    3478
      [1] "data.frame"
	 栽培法A 栽培法B
      1     3063    3157
      2     2275    2707
      3     2089    3270
      4     2855    3181
      5     2836    3633
      6     3219    3404
      7     2817    2219
      8     2136    2730
      9     2540    3408
      10    2263    3203
      11    2140    2938
      12    1757    3286
      13    2499    2920
      14    2093    3332
      15    2073    3478
      [1] "data.frame"
</pre>
</div>


<div id="outline-container-org1ec84b7" class="outline-5">
<h5 id="org1ec84b7">行列化</h5>
<div class="outline-text-5" id="text-org1ec84b7">
<div class="org-src-container">
<pre class="src src-R">
(mat.1.2 <span style="color: #e5786d;">&lt;-</span> matrix(as.matrix(csv.1.2), nrow(csv.1.2), ncol(csv.1.2))) 
class(mat.1.2)

</pre>
</div>

<pre class="example" id="org6ea37f7">
	     [,1] [,2]
	[1,] 3063 3157
	[2,] 2275 2707
	[3,] 2089 3270
	[4,] 2855 3181
	[5,] 2836 3633
	[6,] 3219 3404
	[7,] 2817 2219
	[8,] 2136 2730
	[9,] 2540 3408
       [10,] 2263 3203
       [11,] 2140 2938
       [12,] 1757 3286
       [13,] 2499 2920
       [14,] 2093 3332
       [15,] 2073 3478
       [1] "matrix"
</pre>

<div class="org-src-container">
<pre class="src src-R">
(z1 <span style="color: #e5786d;">&lt;-</span> (mat.1.2[,1] - mean(mat.1.2[,1]))/sqrt(var(mat.1.2[,1])))
(z2 <span style="color: #e5786d;">&lt;-</span> (mat.1.2[,2] - mean(mat.1.2[,2]))/sqrt(var(mat.1.2[,2])))

</pre>
</div>

<pre class="example">
 [1]  1.4468709 -0.3940348 -0.8285633  0.9609465  0.9165592  1.8113141
 [7]  0.8721719 -0.7187631  0.2250515 -0.4220689 -0.7094184 -1.6041733
[13]  0.1292683 -0.8192186 -0.8659421
 [1]  0.08921788 -1.14231733  0.39847006  0.15489976  1.39190846  0.76519388
 [7] -2.47784884 -1.07937219  0.77614086  0.21510815 -0.51012925  0.44225798
[13] -0.55939066  0.56814824  0.96771300
</pre>


<div class="org-src-container">
<pre class="src src-R">
c(<span style="color: #95e454;">"z1 (mean, var,sd): "</span>, mean(z1), var(z1), sqrt(var(z1)))
c(<span style="color: #95e454;">"z2 (mean, var,sd): "</span>, mean(z2), var(z2), sqrt(var(z2)))

</pre>
</div>

<pre class="example">
[1] "z1 (mean, var,sd): "  "3.49727480771408e-16" "1"                   
[4] "1"
[1] "z2 (mean, var,sd): "   "-2.46084981096277e-16" "1"                    
[4] "1"
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org8fe3edb" class="outline-3">
<h3 id="org8fe3edb">2.5 ポアソン分布</h3>
<div class="outline-text-3" id="text-org8fe3edb">
<div class="org-src-container">
<pre class="src src-R">dev.new()
x <span style="color: #e5786d;">&lt;-</span> 0:10
plot(0,0, xlim=c(0,10), ylim=c(0,0.5), type=<span style="color: #95e454;">"l"</span>,
     main=<span style="color: #95e454;">"&#12509;&#12450;&#12477;&#12531;&#20998;&#24067;"</span>,
     ylab=<span style="color: #95e454;">"&#30906;&#29575;"</span>,
     xlab=<span style="color: #95e454;">"&#20986;&#29694;&#20516;"</span>,xaxt=<span style="color: #95e454;">"n"</span>)
<span style="color: #8ac6f2; font-weight: bold;">for</span> (lamb <span style="color: #8ac6f2; font-weight: bold;">in</span> c(1,2,3,4,5,6,7,8,9,10)) {
  points(x, dpois(x, lamb), type=<span style="color: #95e454;">"l"</span>)
}

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師</p>
<p class="date">Created: 2021-10-27 水 23:35</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
